# Practicumopdrachten Week 2.3 (eerste kans)

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige practicum de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [1]:
import pandas as pd
import sqlite3

C:\Users\prati\AppData\Local\Temp\ipykernel_12440\2059591896.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

Zet het bestand go_sales.sqlite in hetzelfde mapje als dit notebook.

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige practicum de code om een connectie met het bestand go_sales.sqlite te maken.

In [2]:
database_path = 'go_sales.sqlite'
conn = sqlite3.connect(database_path)

Lees van de ingelezen go_sales-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- target
- returned_item
- return_reason

In [3]:
import sqlite3
import pandas as pd

database_path = 'go_sales.sqlite'
conn = sqlite3.connect(database_path)

# Functie om een query uit te voeren en het resultaat als DataFrame terug te geven
def lees_tabel(tabel):
    query = f'SELECT * FROM {tabel}'
    return pd.read_sql_query(query, conn)

# Lijst met tabellen
tabellen = ['product', 'product_type', 'product_line', 'sales_staff', 'sales_branch',
            'retailer_site', 'country', 'order_header', 'order_details', 'SALES_TARGETdata',
            'returned_item', 'return_reason']

# Inlezen van elke tabel en deze opslaan in een dictionary met de tabelnaam als key
dataframes = {tabel: lees_tabel(tabel) for tabel in tabellen}

# Toegang tot de ingelezen tabellen
product_tabel = dataframes['product']
product_type_tabel = dataframes['product_type']
product_line_tabel = dataframes['product_line']
sales_staff_tabel = dataframes['sales_staff']
sales_branch_tabel = dataframes['sales_branch']
retailer_site_tabel = dataframes['retailer_site']
country_tabel = dataframes['country']
order_header_tabel = dataframes['order_header']
order_details_tabel = dataframes['order_details']
target_tabel = dataframes['SALES_TARGETdata']  # Verander 'target' naar 'SALES_TARGETdata'
returned_item_tabel = dataframes['returned_item']
return_reason_tabel = dataframes['return_reason']

print(target_tabel.head())

   Id SALES_STAFF_CODE SALES_YEAR SALES_PERIOD       RETAILER_NAME  \
0   1                6       2021            5  Altitudes extrêmes
1   2                6       2021            5  Altitudes extrêmes
2   3                6       2021            5  Altitudes extrêmes
3   4                6       2021            5     Camping Sauvage
4   5                6       2021            5     Camping Sauvage

  PRODUCT_NUMBER SALES_TARGET RETAILER_CODE TRIAL888
0             53          489            33        T
1             55          666            33        T
2             56          682            33        T
3             76         3193            35        T
4             85         7236            35        T

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [8]:
import sqlite3
import pandas as pd

# Verbinding maken met de SQLite-database
database_path = 'go_sales.sqlite'
conn = sqlite3.connect(database_path)

# SQL-query om producten en hun productiekosten te selecteren
# Query opstellen met de juiste kolomnamen (let op: kolomnamen zijn hoofdlettergevoelig)
query = "SELECT product_name, production_cost FROM product WHERE production_cost > 50 AND production_cost < 100"

# Uitvoeren van de query en het ophalen van de resultaten in een DataFrame
result = pd.read_sql_query(query, conn)

# Weergave van de resultaten
print(result)

Empty DataFrame
Columns: [PRODUCT_NAME, PRODUCTION_COST]
Index: []

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [9]:
# SQL-query om producten en hun marge te selecteren
query = '''
    SELECT product_name, margin
    FROM product
    WHERE margin < 20 OR margin > 60
'''

# Uitvoeren van de query en het resultaat als DataFrame opslaan
product_marge_overzicht = pd.read_sql_query(query, conn)


# Toon het overzicht
print(product_marge_overzicht)

                 PRODUCT_NAME MARGIN
0         TrailChef Water Bag    .33
1          TrailChef Utensils     .4
2          Insect Bite Relief     .5
3       Hailstorm Steel Irons    .43
4    Hailstorm Titanium Irons    .51
..                        ...    ...
110                Sun Shield     .5
111        Compact Relief Kit    .28
112  Deluxe Family Relief Kit    .28
113           Calamine Relief     .5
114               Aloe Relief     .6

[115 rows x 2 columns]

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [10]:
query = "SELECT DISTINCT country FROM country WHERE currency_name = 'francs' ORDER BY country"

# Resultaat wordt in een Dataframe opgeslagen
franc_betalende_landen_overzicht = pd.read_sql_query(query, conn)

print(franc_betalende_landen_overzicht)

       COUNTRY
0      Belgium
1       France
2  Switzerland

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [11]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('go_sales.sqlite')

# Query opstellen
query = """
SELECT PRODUCT_NUMBER, INTRODUCTION_DATE, MARGIN
FROM product
WHERE MARGIN > 0.5
"""

# Uitvoeren van de query en het ophalen van de resultaten in een DataFrame
result = pd.read_sql_query(query, conn)

# Weergave van de resultaten
print(result)

Empty DataFrame
Columns: [PRODUCT_NUMBER, INTRODUCTION_DATE, MARGIN]
Index: []

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 28 rijen)

In [9]:
# Query opstellen
query = """
SELECT ADDRESS1, ADDRESS2, CITY
FROM sales_branch
WHERE ADDRESS2 IS NOT NULL AND REGION IS NOT NULL
"""

# Uitvoeren van de query en het ophalen van de resultaten in een DataFrame
result = pd.read_sql_query(query, conn)

# Weergave van de resultaten
print(result)

                           ADDRESS1           ADDRESS2              CITY
0  Prol. Paseo de la Reforma No. 51  Lomas de Santa Fe  Distrito Federal
1               202-2-3 Hyakunincho        Shinjuku-ku             Tokyo
2                     543-225 Asahi           Asahi-ku        Osaka City
3                  2315 Queen's Ave            Level 2         Melbourne
4             Avenida Paulista, 333   CJ 231 2o. Andar         São Paulo
5                    3 Albany Court      Market Street        Birmingham
6               Singelgravenplein 4      4e verdieping         Amsterdam

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [58]:
query = """
SELECT DISTINCT COUNTRY
FROM country
WHERE CURRENCY_NAME IN ('dollars', 'new dollar')
ORDER BY COUNTRY
"""

result = pd.read_sql_query(query, conn)

print(result)

         COUNTRY
0      Australia
1         Canada
2         Taiwan
3  United States

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [4]:
query = """
SELECT ADDRESS1, ADDRESS2, CITY
FROM RETAILER_SITE
WHERE COUNTRY_CODE = 'D' AND ADDRESS2 IS NOT NULL
"""

result = pd.read_sql_query(query, conn)

print(result)

Empty DataFrame
Columns: [ADDRESS1, ADDRESS2, CITY]
Index: []

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [5]:
query = """
SELECT SUM(RETURN_QUANTITY) AS TotalReturnedProducts
FROM returned_item
"""

result = conn.execute(query).fetchone() # fetchone haalt alleen 1 rij op

# result[0] = eerste element uit tupel (aantal teruggebrachte producten)
# if result is not None = geen resultaat betekent '0'
print("Totaal aantal teruggebrachte producten:", result[0] if result is not None else 0)

Totaal aantal teruggebrachte producten: 14306

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [4]:
query = """
SELECT COUNT(DISTINCT REGION) AS NumberOfRegions
FROM sales_branch
"""

result = conn.execute(query).fetchone()

print("Aantal regio's waarin verkoopafdelingen zijn gevestigd:", result[0] if result is not None else 0)

Aantal regio's waarin verkoopafdelingen zijn gevestigd: 15

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [5]:
# Query opstellen voor laagste marge
min_query = """
SELECT MIN(MARGIN) AS LowestMargin
FROM product
"""

# Query opstellen voor hoogste marge
max_query = """
SELECT MAX(MARGIN) AS HighestMargin
FROM product
"""

# Query opstellen voor gemiddelde marge (afgerond op 2 decimalen)
avg_query = """
SELECT ROUND(AVG(MARGIN), 2) AS AverageMargin
FROM product
"""

# Uitvoeren van de queries
min_result = conn.execute(min_query).fetchone()
max_result = conn.execute(max_query).fetchone()
avg_result = conn.execute(avg_query).fetchone()

# Toewijzen van waarden aan variabelen
lowest_margin = min_result[0] if min_result is not None else None
highest_margin = max_result[0] if max_result is not None else None
average_margin = avg_result[0] if avg_result is not None else None


print("Laagste marge:", lowest_margin)
print("Hoogste marge:", highest_margin)
print("Gemiddelde marge:", average_margin)

Laagste marge: .17
Hoogste marge: .7
Gemiddelde marge: 0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [66]:
query = """
SELECT COUNT(*)
FROM retailer_site
WHERE ADDRESS2 IS NULL
"""

result = conn.execute(query).fetchone()


print("Aantal vestigingen zonder tweede adres:", result[0] if result is not None else 0)

Aantal vestigingen zonder tweede adres: 286

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [67]:
query = """
SELECT AVG(UNIT_COST) AS AverageCostPrice
FROM order_details
WHERE UNIT_SALE_PRICE < UNIT_PRICE
"""

result = conn.execute(query).fetchone()

print("Gemiddelde kostprijs van verkochte producten met korting:", round(result[0], 2) if result is not None else 0.0)

Gemiddelde kostprijs van verkochte producten met korting: 121.99

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [69]:
query = """
SELECT POSITION_EN, COUNT(*) AS NumberOfEmployees
FROM sales_staff
GROUP BY POSITION_EN
"""

result = pd.read_sql_query(query, conn)

print(result)

                    POSITION_EN  NumberOfEmployees
0                Branch Manager                 19
1              District Manager                  4
2               General Manager                  1
3  Level 1 Sales Representative                 13
4  Level 2 Sales Representative                 39
5  Level 3 Sales Representative                 24
6              Regional Manager                  2

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [70]:
query = """
SELECT WORK_PHONE, COUNT(*) AS NumberOfEmployees
FROM sales_staff
GROUP BY WORK_PHONE
HAVING NumberOfEmployees > 4
"""

result = pd.read_sql_query(query, conn)

print(result)

            WORK_PHONE  NumberOfEmployees
0    +(44) 121 3505267                  5
1  +(61) 03 2982  4242                  5
2  +31 (0)20 692 93 94                  5
3    +33 1 68 94 52 20                  5
4     1 (206) 292-0012                  5
5     1 (305) 557-4810                  6
6     1 (310) 281-5722                  5
7     1 (403) 232-5986                  5
8     1 (416) 493-5595                  5
9     1 (617) 268-6754                  6

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [71]:
query = """
SELECT rs.ADDRESS1, rs.CITY
FROM retailer_site rs
JOIN country c ON rs.COUNTRY_CODE = c.COUNTRY_CODE
WHERE c.COUNTRY = 'Netherlands'
"""

result = pd.read_sql_query(query, conn)

print(result)

                     ADDRESS1          CITY
0                    Beets 36         Beets
1                Perestraat 1      Deventer
2   Laan van Meerdervoort 966      Den Haag
3              Kalfjeslaan 47    Amstelveen
4                Startbaan 11    Amstelveen
5       Noorderspoorsingel 28     Groningen
6               Hogehilweg 13     Amsterdam
7              Spoorstraat 43    Varsseveld
8              Westhavenweg 8     Amsterdam
9               Westzeedijk 4        Muiden
10            Gooiergracht 91         Laren
11            Hoofdstraat 150   Pieterburen
12                Olde Diek 2         Laren
13     Amsterdamsestraatweg 8      Maarssen
14        Krayenhoffstraat 11     Amsterdam
15         Overschiestraat 19     Amsterdam
16              Havenbuurt 12        Marken
17               Duivendaal 1    Wageningen
18              Voorstraat 37  Nieuweschans
19         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [6]:
query = """
SELECT p.PRODUCT_NAME
FROM product p
JOIN product_type pt ON p.PRODUCT_TYPE_CODE = pt.PRODUCT_TYPE_CODE
WHERE pt.PRODUCT_TYPE_EN = 'Eyewear'
"""

result = pd.read_sql_query(query, conn)

print(result)

    PRODUCT_NAME
0      Polar Sun
1      Polar Ice
2   Polar Sports
3     Polar Wave
4  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [73]:
query = """
SELECT DISTINCT rs.ADDRESS1, ss.FIRST_NAME, ss.LAST_NAME
FROM retailer_site rs
JOIN order_header oh ON rs.RETAILER_SITE_CODE = oh.RETAILER_SITE_CODE
JOIN sales_staff ss ON oh.SALES_STAFF_CODE = ss.SALES_STAFF_CODE
WHERE ss.POSITION_EN = 'Branch Manager'
"""

result = pd.read_sql_query(query, conn)

print(result)

               ADDRESS1 FIRST_NAME LAST_NAME
0  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 9 rijen)

In [74]:
query = """
SELECT DISTINCT ss.POSITION_EN, oh.ORDER_DATE
FROM sales_staff ss
LEFT JOIN order_header oh ON ss.SALES_STAFF_CODE = oh.SALES_STAFF_CODE
LEFT JOIN order_details od ON oh.ORDER_NUMBER = od.ORDER_NUMBER
WHERE ss.POSITION_EN LIKE '%Manager%'
"""

result = pd.read_sql_query(query, conn)

print(result)

        POSITION_EN  ORDER_DATE
0    Branch Manager        None
1   General Manager        None
2  Regional Manager        None
3  District Manager        None
4    Branch Manager  2022-09-09
5    Branch Manager  2022-10-31
6    Branch Manager  2022-12-13
7    Branch Manager  2022-03-13
8    Branch Manager  2022-01-09

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [75]:
query = """
SELECT DISTINCT p.PRODUCT_NAME, pt.PRODUCT_TYPE_EN
FROM product p
JOIN product_type pt ON p.PRODUCT_TYPE_CODE = pt.PRODUCT_TYPE_CODE
JOIN order_details od ON p.PRODUCT_NUMBER = od.PRODUCT_NUMBER
WHERE od.QUANTITY > 750
"""

result = pd.read_sql_query(query, conn)

print(result)

            PRODUCT_NAME    PRODUCT_TYPE_EN
0         Sun Shelter 30          Sunscreen
1        BugShield Spray  Insect Repellents
2  BugShield Lotion Lite  Insect Repellents
3              Firefly 2           Lanterns
4       BugShield Lotion  Insect Repellents
5      BugShield Extreme  Insect Repellents
6         Sun Shelter 15          Sunscreen
7             Sun Shield          Sunscreen
8               Star Peg              Tents

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [76]:
query = """
SELECT DISTINCT p.PRODUCT_NAME
FROM product p
JOIN order_details od ON p.PRODUCT_NUMBER = od.PRODUCT_NUMBER
WHERE ((od.UNIT_PRICE - od.UNIT_SALE_PRICE) / od.UNIT_PRICE) > 0.4
"""

result = pd.read_sql_query(query, conn)

print(result)

                   PRODUCT_NAME
0         BugShield Lotion Lite
1             BugShield Extreme
2             BugShield Natural
3                Sun Shelter 30
4              BugShield Lotion
5               BugShield Spray
6  Hailstorm Titanium Woods Set
7                Sun Shelter 15

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [81]:
query = """
SELECT DISTINCT rr.RETURN_DESCRIPTION_EN
FROM return_reason rr
JOIN returned_item ri ON rr.RETURN_REASON_CODE = ri.RETURN_REASON_CODE
JOIN order_details od ON ri.ORDER_DETAIL_CODE = od.ORDER_DETAIL_CODE
WHERE (ri.RETURN_QUANTITY / od.QUANTITY) > 0.9
"""

result = pd.read_sql_query(query, conn)

print(result)

    RETURN_DESCRIPTION_EN
0  Unsatisfactory product
1   Wrong product shipped
2   Wrong product ordered

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [82]:
query = """
SELECT pt.PRODUCT_TYPE_EN, COUNT(p.PRODUCT_NUMBER) AS NumberOfProducts
FROM product_type pt
JOIN product p ON pt.PRODUCT_TYPE_CODE = p.PRODUCT_TYPE_CODE
GROUP BY pt.PRODUCT_TYPE_EN
"""

result = pd.read_sql_query(query, conn)

print(result)

         PRODUCT_TYPE_EN  NumberOfProducts
0             Binoculars                 4
1   Climbing Accessories                 7
2           Cooking Gear                10
3                Eyewear                 5
4              First Aid                 5
5       Golf Accessories                 4
6      Insect Repellents                 5
7                  Irons                 4
8                 Knives                 5
9               Lanterns                12
10            Navigation                 4
11                 Packs                 6
12               Putters                 3
13                  Rope                 4
14                Safety                 4
15         Sleeping Bags                 7
16             Sunscreen                 5
17                 Tents                 6
18                 Tools                 6
19               Watches                 5
20                 Woods                 4

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [83]:
query = """
SELECT c.COUNTRY, COUNT(rs.RETAILER_SITE_CODE) AS NumberOfLocations
FROM country c
JOIN retailer_site rs ON c.COUNTRY_CODE = rs.COUNTRY_CODE
GROUP BY c.COUNTRY
"""

result = pd.read_sql_query(query, conn)

print(result)

           COUNTRY  NumberOfLocations
0        Australia                 10
1          Austria                 10
2          Belgium                 10
3           Brazil                  1
4           Canada                 31
5            China                 10
6          Denmark                  6
7          Finland                  5
8           France                 29
9          Germany                 32
10           Italy                 12
11           Japan                 25
12           Korea                 10
13          Mexico                 10
14     Netherlands                 20
15           Spain                  9
16          Sweden                 12
17     Switzerland                 13
18          Taiwan                 10
19  United Kingdom                 25
20   United States                101

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (4 kolommen, 10 rijen)

In [85]:
query = """
SELECT p.PRODUCT_NAME,
       ROUND(SUM(od.QUANTITY), 2) AS TotalSold,
       ROUND(AVG(od.UNIT_SALE_PRICE), 2) AS AverageSalePrice,
       ROUND((SUM(od.QUANTITY) * AVG(od.UNIT_SALE_PRICE)), 2) AS TotalRevenue
FROM product p
JOIN product_type pt ON p.PRODUCT_TYPE_CODE = pt.PRODUCT_TYPE_CODE
JOIN order_details od ON p.PRODUCT_NUMBER = od.PRODUCT_NUMBER
WHERE pt.PRODUCT_TYPE_EN = 'Cooking Gear'
GROUP BY p.PRODUCT_NAME
ORDER BY TotalSold DESC
"""

result = pd.read_sql_query(query, conn)

print(result)

                PRODUCT_NAME  TotalSold  AverageSalePrice  TotalRevenue
0        TrailChef Water Bag    41770.0              6.00     250589.33
1              TrailChef Cup    31834.0              6.95     221118.19
2          TrailChef Canteen    31712.0             11.93     378327.94
3      TrailChef Kitchen Kit    25964.0             22.21     576665.58
4         TrailChef Utensils    15928.0             17.13     272884.82
5     TrailChef Double Flame    14510.0            131.35    1905859.67
6         TrailChef Cook Set    12700.0             51.20     650297.84
7     TrailChef Single Flame    10614.0             63.57     674757.42
8           TrailChef Kettle     9900.0             12.13     120094.75
9  TrailChef Deluxe Cook Set     3744.0            120.30     450416.93

Geef een overzicht met daarin van de verkopers behorend tot de verkoopafdeling uit ‘Amsterdam’ de voornaam en achternaam van de verkoper en zijn laagste en hoogste verkooptarget van 2006. (4 kolommen, 4 rijen)

In [88]:
query = """
SELECT ss.FIRST_NAME,
       ss.LAST_NAME,
       MIN(st.SALES_TARGET) AS LowestSalesTarget,
       MAX(st.SALES_TARGET) AS HighestSalesTarget
FROM sales_staff ss
JOIN sales_targetdata st ON ss.SALES_STAFF_CODE = st.SALES_STAFF_CODE
JOIN sales_branch sb ON ss.SALES_BRANCH_CODE = sb.SALES_BRANCH_CODE
WHERE sb.CITY = 'Amsterdam' AND st.SALES_YEAR = 2006
GROUP BY ss.FIRST_NAME, ss.LAST_NAME
"""

result = pd.read_sql_query(query, conn)


print(result)

Empty DataFrame
Columns: [FIRST_NAME, LAST_NAME, LowestSalesTarget, HighestSalesTarget]
Index: []

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

In [89]:
query = """
SELECT c.COUNTRY AS Land,
       sb.CITY AS Verkoper,
       COUNT(DISTINCT rs.CITY) AS Klanten
FROM country c
JOIN sales_branch sb ON c.COUNTRY_CODE = sb.COUNTRY_CODE
JOIN retailer_site rs ON c.COUNTRY_CODE = rs.COUNTRY_CODE
GROUP BY c.COUNTRY, sb.CITY
"""

result = pd.read_sql_query(query, conn)

print(result)

              Land          Verkoper  Klanten
0        Australia         Melbourne        6
1          Austria              Wien        9
2          Belgium          Heverlee        8
3           Brazil         São Paulo        1
4           Canada           Calgary       16
5           Canada           Toronto       16
6            China          Shanghai        7
7          Finland            Kuopio        5
8           France              Lyon       14
9           France             Paris       14
10         Germany           Hamburg       18
11         Germany           München       18
12           Italy            Milano        9
13           Japan        Osaka City        5
14           Japan             Tokyo        5
15           Korea             Seoul        6
16          Mexico  Distrito Federal        6
17     Netherlands         Amsterdam       15
18           Spain            Bilbao        5
19          Sweden             Kista       10
20     Switzerland            Zürich        9
21          Taiwan         San Chung        9
22  United Kingdom        Birmingham        9
23  United Kingdom            London        9
24   United States            Boston       62
25   United States       Los Angeles       62
26   United States             Miami       62
27   United States           Seattle       62

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [91]:
# select 1 = bevestiging dat er maar 1 rij in de subquery bestaat
query = """
SELECT ss.FIRST_NAME, ss.LAST_NAME
FROM sales_staff ss
WHERE NOT EXISTS (
    SELECT 1 
    FROM order_header oh
    WHERE oh.SALES_STAFF_CODE = ss.SALES_STAFF_CODE
)
"""

result = pd.read_sql_query(query, conn)


print(result)

   FIRST_NAME      LAST_NAME
0      Walter         Taylor
1    Penelope        Tamrine
2       Polly         Linton
3       Gracy        Gellens
4        Else         Mörike
5       Frank          Fuchs
6       Fritz         Hirsch
7        Jörg          Kunze
8       Maria      Iacobucci
9        Kick        Kalkman
10      Karin      Bergström
11      Denis           Pagé
12      Sally          White
13      Frank        Bretton
14    Georges  Saint-Germain
15       Alex      Rodriguez
16   Samantha          Floyd
17      Julie          Olsen
18      Corey         Wright
19    Estelle        Johnson
20       Greg        Belding
21      Julie        Béchard
22      Lucía          Reyna
23     Kazumi        Uragome
24      Alice         Walter

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

In [95]:
# WITH = Tijdelijke resultaatset, wordt uitgevoerd in de hoofdquery
query = """
WITH ProductsWithLowMargin AS (
    SELECT *
    FROM product
    WHERE MARGIN < (SELECT AVG(MARGIN) FROM product)
)
SELECT COUNT(*) AS NumberOfProducts,
       AVG(MARGIN) AS AverageMargin
FROM ProductsWithLowMargin
"""

result = pd.read_sql_query(query, conn)

print(result)

   NumberOfProducts  AverageMargin
0               115       0.396609

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

In [99]:
query = """
SELECT DISTINCT p.PRODUCT_NAME
FROM product p
JOIN order_details od ON p.PRODUCT_NUMBER = od.PRODUCT_NUMBER
LEFT JOIN returned_item ri ON od.ORDER_DETAIL_CODE = ri.ORDER_DETAIL_CODE
WHERE od.UNIT_SALE_PRICE > 500
  AND ri.ORDER_DETAIL_CODE IS NULL
"""

result = pd.read_sql_query(query, conn)

print(result)

                      PRODUCT_NAME
0            Hailstorm Steel Irons
1         Hailstorm Titanium Irons
2       Lady Hailstorm Steel Irons
3    Lady Hailstorm Titanium Irons
4   Lady Hailstorm Steel Woods Set
..                             ...
57                 Firefly Extreme
58                 EverGlow Double
59                      Hibernator
60          TrailChef Double Flame
61               Firefly Mapreader

[62 rows x 1 columns]

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

In [100]:
query = """
SELECT *
FROM sales_staff
"""

employees = pd.read_sql_query(query, conn)

# Extra kolom 'IsManager'
employees['IsManager'] = ['Ja' if 'Manager' in position else 'Nee' for position in employees['POSITION_EN']]

# Selecteer kolommen
result = employees[['LAST_NAME', 'IsManager']]

print(result)

      LAST_NAME IsManager
0    Savolainen       Nee
1           Kim       Nee
2          Choi       Nee
3           Kao       Nee
4          Fang       Nee
..          ...       ...
97     Iglesias       Nee
98        Lopes        Ja
99       Barros       Nee
100   Guimarães       Nee
101    Lindholm       Nee

[102 rows x 2 columns]

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [101]:
from datetime import date
date.today().year

2024

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [102]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 25 jaar in dienst) of een ‘lang in dienst’ (groter gelijk dan 12 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

In [105]:
query = """
SELECT *
FROM sales_staff
"""

employees = pd.read_sql_query(query, conn)

# Huidige datum
current_date = datetime.now()

# Extra kolommen voor 'KortInDienst' en 'LangInDienst'
employees['KortInDienst'] = ['Ja' if (current_date - datetime.strptime(date_hired, '%d-%m-%Y')).days < 25*365 else 'Nee' for date_hired in employees['DATE_HIRED']]
employees['LangInDienst'] = ['Ja' if (current_date - datetime.strptime(date_hired, '%d-%m-%Y')).days >= 12*365 else 'Nee' for date_hired in employees['DATE_HIRED']]

result = employees[['LAST_NAME', 'KortInDienst', 'LangInDienst']]

print(result)

      LAST_NAME KortInDienst LangInDienst
0    Savolainen           Ja          Nee
1           Kim           Ja          Nee
2          Choi           Ja          Nee
3           Kao           Ja          Nee
4          Fang           Ja          Nee
..          ...          ...          ...
97     Iglesias           Ja          Nee
98        Lopes           Ja          Nee
99       Barros           Ja          Nee
100   Guimarães           Ja          Nee
101    Lindholm           Ja          Nee

[102 rows x 3 columns]